_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 128, 128, 32)      896       
_________________________________________________________________
activation_1 (Activation)    (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 127, 127, 64)      8256      
_________________________________________________________________
activation_2 (Activation)    (None, 127, 127, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 126, 126, 128)     32896     
_________________________________________________________________
activation_3 (Activation)    (None, 126, 126, 128)     0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 508032)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65028224  
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 65,070,401
Trainable params: 65,070,401
Non-trainable params: 0
_________________________________________________________________
451.jpg 452.jpg 453.jpg 454.jpg 455.jpg 456.jpg 457.jpg 458.jpg 459.jpg 460.jpg 461.jpg 462.jpg 463.jpg 464.jpg 465.jpg 466.jpg 467.jpg 468.jpg 469.jpg 470.jpg 471.jpg 472.jpg 473.jpg 474.jpg 475.jpg 476.jpg 477.jpg 478.jpg 479.jpg 480.jpg 481.jpg 482.jpg 483.jpg 484.jpg 485.jpg 486.jpg 487.jpg 488.jpg 489.jpg 490.jpg 491.jpg 492.jpg 493.jpg 494.jpg 495.jpg 496.jpg 497.jpg 498.jpg 499.jpg 500.jpg 

Predicted beauty scores:
 [1.9834324, 1.8757209, 1.9307988, 1.7059356, 1.870477, 1.9540973, 1.8730762, 2.2296739, 2.1658854, 2.2846556, 1.9325601, 2.342229, 2.2072344, 1.8882492, 2.6487432, 3.4054065, 2.609355, 3.2137027, 2.1751304, 2.4788318, 2.3350186, 2.1927862, 2.5278091, 2.4883041, 2.1570091, 2.0319972, 2.2134938, 2.5308576, 2.154407, 1.9273375, 2.2605305, 1.962798, 1.9838778, 2.228335, 1.8135238, 1.9702823, 1.7924947, 2.5664816, 2.1205416, 2.3639617, 2.1870618, 2.2626357, 2.137268, 2.0128841, 2.0708613, 2.5126557, 2.0146234, 2.2261348, 1.8582524, 2.6934633]

Correlation:  0.68314663831739
